[
  {
    "id": 1,
    "text": "I feel comfortable expressing my emotions openly to others.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 2,
    "text": "I enjoy activities that involve competition and winning.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 3,
    "text": "I prefer clothing styles that are traditionally associated with one gender.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 4,
    "text": "I often take the lead in group situations.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 5,
    "text": "I value nurturing and caring for others in my daily life.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 6,
    "text": "I am drawn to hobbies or interests that are considered creative or artistic.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 7,
    "text": "I am comfortable showing physical affection to friends and family.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 8,
    "text": "I enjoy solving practical problems using logic and analysis.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 9,
    "text": "I am attentive to my appearance and grooming.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 10,
    "text": "I seek out opportunities to support and encourage others emotionally.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 11,
    "text": "I prefer to make decisions based on facts rather than feelings.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 12,
    "text": "I am interested in activities that involve teamwork and cooperation.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 13,
    "text": "I am comfortable asserting my opinions, even if they differ from others.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 14,
    "text": "I enjoy discussing personal feelings with close friends.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 15,
    "text": "I am drawn to leadership roles in my community or workplace.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 16,
    "text": "I find satisfaction in helping others resolve conflicts.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 17,
    "text": "I am interested in sports or physical activities that require strength or endurance.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 18,
    "text": "I appreciate beauty in art, music, or nature.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 19,
    "text": "I am comfortable taking risks in unfamiliar situations.",
    "axis": "x",
    "reverse": true
  },
  {
    "id": 20,
    "text": "I enjoy planning social gatherings or events for friends and family.",
    "axis": "x",
    "reverse": false
  },
  {
    "id": 21,
    "text": "I enjoy taking charge when working in a group.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 22,
    "text": "I often defer to others when making decisions.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 23,
    "text": "I am comfortable voicing my opinions, even in disagreement.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 24,
    "text": "I prefer to let others set the direction in collaborative projects.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 25,
    "text": "I feel confident making decisions without seeking approval.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 26,
    "text": "I tend to avoid conflict, even if it means not expressing my true feelings.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 27,
    "text": "I am willing to take initiative to solve problems.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 28,
    "text": "I rely on others to guide me in unfamiliar situations.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 29,
    "text": "I am assertive when negotiating for my needs.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 30,
    "text": "I find it difficult to say \"no\" to requests from others.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 31,
    "text": "I enjoy being recognized for leadership or achievement.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 32,
    "text": "I am sensitive to criticism from authority figures.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 33,
    "text": "I am comfortable giving instructions or feedback to others.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 34,
    "text": "I prefer to follow established rules rather than challenge them.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 35,
    "text": "I am willing to stand up for my beliefs, even if unpopular.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 36,
    "text": "I seek reassurance from others before making important decisions.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 37,
    "text": "I am comfortable managing others in a work or social setting.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 38,
    "text": "I tend to accommodate others' preferences to avoid disagreement.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 39,
    "text": "I feel energized by taking responsibility for group outcomes.",
    "axis": "y",
    "reverse": true
  },
  {
    "id": 40,
    "text": "I am hesitant to express disagreement with people in authority.",
    "axis": "y",
    "reverse": false
  },
  {
    "id": 41,
    "text": "I desire deep emotional closeness in my relationships.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 42,
    "text": "I am primarily interested in physical intimacy with my partners.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 43,
    "text": "I value spending quality time and sharing personal thoughts with someone I care about.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 44,
    "text": "I am attracted to people based on their physical appearance.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 45,
    "text": "I seek relationships that involve long-term commitment and companionship.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 46,
    "text": "I am comfortable expressing affection through sexual activity.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 47,
    "text": "I enjoy romantic gestures such as giving or receiving love notes or gifts.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 48,
    "text": "I prioritize sexual compatibility when choosing a partner.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 49,
    "text": "I feel fulfilled by emotional intimacy, even without sexual activity.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 50,
    "text": "I am interested in exploring new sexual experiences with my partner.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 51,
    "text": "I desire to build a life and future together with someone special.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 52,
    "text": "I am more interested in the excitement of sexual attraction than in emotional connection.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 53,
    "text": "I find satisfaction in sharing my deepest feelings with a partner.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 54,
    "text": "I am comfortable discussing sexual preferences and desires openly.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 55,
    "text": "I seek relationships that are emotionally exclusive and intimate.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 56,
    "text": "I am drawn to relationships that are passionate and physically intense.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 57,
    "text": "I value non-sexual forms of affection, such as cuddling or holding hands.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 58,
    "text": "I am interested in relationships that are primarily sexual rather than romantic.",
    "axis": "z",
    "reverse": false
  },
  {
    "id": 59,
    "text": "I desire to be emotionally vulnerable and open with my partner.",
    "axis": "z",
    "reverse": true
  },
  {
    "id": 60,
    "text": "I am comfortable with relationships that focus on sexual exploration without emotional attachment.",
    "axis": "z",
    "reverse": false
  }
]
